---
kind: other
id: Methods.T:Autodesk.Revit.DB.GeometryCreationUtilities
source: html/b491c511-8302-8eda-5c14-28710bb895b2.htm
---
# GeometryCreationUtilities Methods

Creates a solid by blending two closed curve loops lying in non-coincident planes.